Feature: Login feature
	Отговаря за вход за предвапрително регистрирани потребители

	
  Scenario: Вход в системата с валидни данни
    Given Потребителят отваря началната страница
    And натиска върху бутона за вход в системата
    And появява се форма за вход в системата
    When  въведе валидно потребителско име
    And въведе валидна парола
    And натисне бутона за Логин
    Then вижда съобщение "Login Successful!"
    And има логнат статус
    
   Scenario: Вход в системата с грешно потребителско име
    Given Потребителят отваря началната страница
    And натиска върху бутона за вход в системата
    And появява се форма за вход в системата
    When  въведе невалидно потребителско име
    And въведе валидна парола
    And натисне бутона за Логин
    Then вижда съобщение "Login Failed!"
    
    Scenario: Вход в системата с грешна парола
   Given Потребителят отваря началната страница
    And натиска върху бутона за вход в системата
    And появява се форма за вход в системата
    When  въведе валидно потребителско име
    And въведе невалидна парола
    And натисне бутона за Логин
    Then вижда съобщение "Login Failed!"
    
   Scenario: Вход в системата без име
		Given Потребителят отваря началната страница
    And натиска върху бутона за вход в системата
    And появява се форма за вход в системата
    When  не въвежда потребителско име
    And въведе валидна парола
    And натисне бутона за Логин
    Then вижда съобщение "Login Failed!"
    
    Scenario: Вход в системата без парола
		Given Потребителят отваря началната страница
    And натиска върху бутона за вход в системата
    And появява се форма за вход в системата
    When  въведе валидно потребителско име
    And не въвежда парола
    And натисне бутона за Логин
    Then вижда съобщение "Login Failed!"
    
