Feature: Register feature
 Отговаря за създаването на нови акаунти в системата
  
  Scenario: Създаване на акаунт с валидни данни
    Given Потребителят отваря началната страница с готовност за създаване на акаунт
    And натиска върху бутона за създаване на акаунт
    And визуализира се форма за създаване на акаунт
    When въведе валидно потребителско име на акаунт
    And въведе валидна парола на акаунт
    And натисне бутона за регистрация
    Then вижда съобщение с текст "Registration Successful!"
    
   Scenario: Създаване на акаунт с празно потребителско име
    Given Потребителят отваря началната страница с готовност за създаване на акаунт
    And  натиска върху бутона за създаване на акаунт
    And визуализира се форма за създаване на акаунт
    When въведе празно потребителско име на акаунт
    And въведе валидна парола на акаунт
    And натисне бутона за регистрация
    Then вижда съобщение с текст "Registration Failed! Username is blank"

   Scenario: Създаване на акаунт с празна парола
    Given Потребителят отваря началната страница с готовност за създаване на акаунт
    And  натиска върху бутона за създаване на акаунт
    And визуализира се форма за създаване на акаунт
    When въведе валидно потребителско име на акаунт
    And въведе празна парола на акаунт
    And натисне бутона за регистрация
    Then вижда съобщение с текст "Registration Failed! Password is blank"

    #Scenario: Създаване на акаунт с празно име и парола
    
   Scenario: Създаване на акаунт с име по-голямо от 50 символа
    Given Потребителят отваря началната страница с готовност за създаване на акаунт
    And  натиска върху бутона за създаване на акаунт
    And визуализира се форма за създаване на акаунт
    When въведе потребителско име с повече от 50 символа на акаунт
    And въведе валидна парола на акаунт
    And натисне бутона за регистрация
    Then вижда съобщение с текст "Registration Failed! Username is too long"
    
   Scenario: Създаване на акаунт с парола по-голяма от 32 символа
    Given Потребителят отваря началната страница с готовност за създаване на акаунт
    And  натиска върху бутона за създаване на акаунт
    And визуализира се форма за създаване на акаунт
    When въведе валидно потребителско име на акаунт
    And въведе парола по-голяма от 32 символа на акаунт
    And натисне бутона за регистрация
    Then вижда съобщение с текст "Registration Failed! Password is too long"
    
   Scenario: Създаване на акаунт с име по-малко от 3 символа
    Given Потребителят отваря началната страница с готовност за създаване на акаунт
    And  натиска върху бутона за създаване на акаунт
    And визуализира се форма за създаване на акаунт
    When въведе потребителско име с по-малко от 3 символа на акаунт
    And въведе валидна парола на акаунт
    And натисне бутона за регистрация
    Then вижда съобщение с текст "Registration Failed! Username is too short"
   
   Scenario: Създаване на акаунт с парола по-малка от 8 символа
    Given Потребителят отваря началната страница с готовност за създаване на акаунт
    And  натиска върху бутона за създаване на акаунт
    And визуализира се форма за създаване на акаунт
    When въведе валидно потребителско име на акаунт
    And въведе парола по-малка от 8 символа на акаунт
    And натисне бутона за регистрация
    Then вижда съобщение с текст "Registration Failed! Password is too short"
   