Feature: Projection seat reservation feature
  Отговаря за резервация на дадено място за дадена прожекция

  Scenario: Потребителят резервира място за дадена прожекция
    Given Потребителят отваря началната стравица
    And натиска върху бутона за избор на прожекции
    And избира си прожекция от графика
    And се проверява дали е възможно да се направи резервация
    And визуализара се форма за резервация на дадено място за прожекцията
    When кликне на местата,които ще резервира
    And си въведе името
    And си въведе метод за плащане
    And си въведе детайлите на кредитната карта
    And натисне бутона за създаване на резервация
    Then вижда съобщение "Reservation Successful!"
    And му се изпраща съобщение по email  с детайлите на току що направената резервация
    
   Scenario: Потребителят резервира място за дадена прожекция, но е един час преди започването на прожекцията
    Given Потребителят отваря началната стравица
    And натиска върху бутона за избор на прожекции
    And избира си прожекция от графика
    And се проверява дали е възможно да се направи резервация
    Then се вижда съобщение "Reservation could not be made! Too late!"
    
   Scenario: Потребителят резервира място за дадена прожекция, но няма свободни места
    Given Потребителят отваря началната стравица
    And натиска върху бутона за избор на прожекции
    And избира си прожекция от графика
    And се проверява дали е възможно да се направи резервация
    Then се вижда съобщение "Reservation could not be made! No vacant seats!"

  @tag2
  Scenario Outline: Title of your scenario outline
    Given I want to write a step with <name>
    When I check for the <value> in step
    Then I verify the <status> in step

    Examples: 
      | name  | value | status  |
      | name1 |     5 | success |
      | name2 |     7 | Fail    |
